app/Helpers/MY_form_helper.php

SELECT *
FROM `options`
WHERE `label` = 'EDUCATION_LEVEL'
---
    function easyui_combobox_option($option){
        $db = db_connect();
        $attribute='';
        $attribute.=isset($option['id'])?'id="'.$option['id'].'"':'';
        $attribute.=isset($option['class'])?' class="easyui-combobox '.$option['class'].'"':'class="easyui-combobox"';
        if(!isset($option['alias'])){
            $attribute.=isset($option['name'])?' name="'.$option['name'].'"':'';
        }else{
            $attribute.=isset($option['alias'])?' name="'.$option['alias'].'"':'';
        }
        $attribute.=isset($option['width'])?' style="width:'.$option['width'].';"':'style="width:197px;"';
        $attribute.=isset($option['required'])?' data-options="required:true,prompt:\'---\'"':'';
        $attribute.=isset($option['readonly'])?' disabled="true"':'';

        $label=isset($option['label'])?$option['label']:'';
        $name=isset($option['name'])?$option['name']:'';
        $value=isset($option['value'])?$option['value']:'';
        $html='<select '.$attribute.'>
            <option value=""></option>';
        $query=$db->table('options')->getWhere(['label'=>$label]);