app/Libraries/UserPerm.php

    public function getModule($id=0){
        $module=$this->db->table('modules')
            ->select('modules.*, menus.label as menu_label')
            ->join('menus', 'menus.id = modules.menu_id', 'left')
            ->getWhere(['modules.id'=>$id])
            ->getRowArray();
---
SELECT `modules`.*, `menus`.`label` as `menu_label`
FROM `modules`
LEFT JOIN `menus` ON `menus`.`id` = `modules`.`menu_id`
WHERE `modules`.`id` = 13